; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-4-3-2-7-7-5) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate0)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 distributor0)
	(clear crate4)
	(at pallet5 distributor1)
	(clear crate1)
	(at pallet6 distributor2)
	(clear crate2)
	(at truck0 depot2)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 distributor0)
	(available hoist4)
	(at hoist5 distributor1)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at crate0 depot2)
	(on crate0 pallet2)
	(at crate1 distributor1)
	(on crate1 pallet5)
	(at crate2 distributor2)
	(on crate2 pallet6)
	(at crate3 distributor0)
	(on crate3 pallet4)
	(at crate4 distributor0)
	(on crate4 crate3)
)

(:goal (and
		(on crate0 pallet2)
		(on crate2 crate3)
		(on crate3 pallet0)
		(on crate4 pallet6)
	)
))

; plan
1. (lift hoist4 crate4 crate3 distributor0)
   deleted: (at crate4 distributor0) (available hoist4) (on crate4 crate3) (clear crate4)
   added: (lifting hoist4 crate4) (clear crate3)
   goals met: 1 of 4
2. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 1 of 4
3. (load hoist4 crate4 truck0 distributor0)
   deleted: (lifting hoist4 crate4)
   added: (in crate4 truck0) (available hoist4)
   goals met: 1 of 4
4. (lift hoist4 crate3 pallet4 distributor0)
   deleted: (at crate3 distributor0) (available hoist4) (on crate3 pallet4) (clear crate3)
   added: (lifting hoist4 crate3) (clear pallet4)
   goals met: 1 of 4
5. (load hoist4 crate3 truck0 distributor0)
   deleted: (lifting hoist4 crate3)
   added: (in crate3 truck0) (available hoist4)
   goals met: 1 of 4
6. (lift hoist6 crate2 pallet6 distributor2)
   deleted: (at crate2 distributor2) (available hoist6) (on crate2 pallet6) (clear crate2)
   added: (lifting hoist6 crate2) (clear pallet6)
   goals met: 1 of 4
7. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 1 of 4
8. (load hoist6 crate2 truck0 distributor2)
   deleted: (lifting hoist6 crate2)
   added: (in crate2 truck0) (available hoist6)
   goals met: 1 of 4
9. (unload hoist6 crate4 truck0 distributor2)
   deleted: (available hoist6) (in crate4 truck0)
   added: (lifting hoist6 crate4)
   goals met: 1 of 4
10. (drop hoist6 crate4 pallet6 distributor2)
   deleted: (lifting hoist6 crate4) (clear pallet6)
   added: (at crate4 distributor2) (available hoist6) (on crate4 pallet6) (clear crate4)
   goals met: 2 of 4
11. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 2 of 4
12. (unload hoist0 crate3 truck0 depot0)
   deleted: (available hoist0) (in crate3 truck0)
   added: (lifting hoist0 crate3)
   goals met: 2 of 4
13. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (at crate3 depot0) (available hoist0) (on crate3 pallet0) (clear crate3)
   goals met: 3 of 4
14. (unload hoist0 crate2 truck0 depot0)
   deleted: (available hoist0) (in crate2 truck0)
   added: (lifting hoist0 crate2)
   goals met: 3 of 4
15. (drop hoist0 crate2 crate3 depot0)
   deleted: (lifting hoist0 crate2) (clear crate3)
   added: (at crate2 depot0) (available hoist0) (on crate2 crate3) (clear crate2)
   goals met: 4 of 4
